dhckddus/PICtmp/Wifi_test_210408.X/ESP8266_functions_0318.h
    while(!RCIF); // hold the program till RX buffer is free
                  //repera RX ficar livre
        
    return RCREG; //receive the value and send it to main function
                  //pega o valor recebido e emcaminha para função main
}
//_____________End of function________________//




//**Function to convert string to byte**//
void ESP8266_send_string(char* st_pt)
{
    while(*st_pt) //if there is a char
        _esp8266_putch(*st_pt++); //process it as a byte data
}
//___________End of function______________//
//**End of modified Codes**//


// < : \""
// > : "\"
//**Function to configure soft_AP**//
unsigned char esp8266_config_softAP(unsigned char* softssid, unsigned char* softpass) {
    _esp8266_print("AT+CWSAP=\"");
    _esp8266_print(softssid);
    _esp8266_print("\",\"");
    _esp8266_print(softpass);
    _esp8266_print("\",5,3\r\n");
    return _esp8266_waitResponse();
}

//**Function to configure station**//
unsigned char esp8266_config_Station(unsigned char* softssid, unsigned char* softpass) {
    _esp8266_print("AT+CWJAP=\"");
    _esp8266_print(softssid);
    _esp8266_print("\",\"");
    _esp8266_print(softpass);
    _esp8266_print("\"\r\n");
    return _esp8266_waitResponse();
}


//___________End of function______________//




//**Function to stations IP/MAC**//
 void esp8266_get_stationIP()
    {
    char rex;
    ESP8266_send_string("AT+CWLIF\r\n");
    //Lcd_Set_Cursor(1,1);
    //Lcd_Write_String("IP:");
    do
    {
    rex = _esp8266_getch();
    //Lcd_Write_Char(rex);
    }while(rex!=',');
    //Lcd_Set_Cursor(2,1);
    //Lcd_Write_String("MAC:");
    do
    {
    rex = _esp8266_getch();
    //Lcd_Write_Char(rex);
    }while(rex!='O');
    }
 //___________End of function______________//
 

 
 //**Function to enable multiple connections**//
 void _esp8266_enale_MUX()
 {
 _esp8266_print("AT+CIPMUX=1\r\n"); //Enable Multiple Connections
 _esp8266_waitResponse();
 }
  //___________End of function______________//
 
 
  //**Function to create server on Port 80**//
 void _esp8266_create_server()
 {
    _esp8266_print("AT+CIPSERVER=1,80\r\n"); //Enable Server on port 80
    _esp8266_waitResponse(); 
 }
  //___________End of function______________//
 
 
 
 /*Enter into Start typing the mail*/
 void _esp8266_start_mail()
 {
    _esp8266_print("AT+CIPSEND=4,6\r\n");
    _esp8266_waitResponse();
    _esp8266_print("DATA\r\n");
    _esp8266_waitResponse();
 }
 /*Entered into the typing mode*/
 
 
 /*End the Mail using a "."*/
 void _esp8266_End_mail()
 {
    _esp8266_print("AT+CIPSEND=4,3\r\n");
    _esp8266_waitResponse();
    _esp8266_print(".\r\n");
    _esp8266_waitResponse();
 }
 /*End of mail*/
 
 /*Quit Connection from SMPT server*/
 void _esp8266_disconnect_SMPT2GO()
 {
    _esp8266_print("AT+CIPSEND=4,6\r\n");
    _esp8266_waitResponse();
    _esp8266_print("QUIT\r\n");
    _esp8266_waitResponse();
 }
 /*Disconnected*/
 
 
 

 /*Connect to SMPT2GO server*/
 void _esp8266_connect_SMPT2GO()
 {
    _esp8266_print("AT+CIPSTART=4,\"TCP\",\"mail.smtp2go.com\",2525\r\n");
    _esp8266_waitResponse();
    _esp8266_print("AT+CIPSEND=4,20\r\n");
    _esp8266_waitResponse();
    _esp8266_print("EHLO 192.168.1.123\r\n");
    _esp8266_waitResponse();
    _esp8266_print("AT+CIPSEND=4,12\r\n");
    _esp8266_waitResponse();
    _esp8266_print("AUTH LOGIN\r\n");
    _esp8266_waitResponse();
 }
    /*connected to Server*/
 
 /*LOG IN with your SMPT2GO approved mail ID*/
    /*Visit the page https://www.smtp2go.com/ and sign up using any Gmail ID
     * Once you gmail ID is SMPT2GO approved convert your mail ID and password in 64 base format
     * visit https://www.base64encode.org/ for converting 64 base format online
     * FORMAT -> _esp8266_login_mail("mailID in base 64","Password in base 64");
     * This program uses the ID-> aswinthcd@gmail.com and password -> circuitdigest as an example
     */
 void _esp8266_login_mail(unsigned char* mail_ID, unsigned char* mail_Pas) {
     len = strlen(mail_ID);
     len+= 2;
     char l2 = len%10;
     char l1 = (len/10)%10;
     
     _esp8266_print("AT+CIPSEND=4,");
     if ((l1+'0')>'0')
     _esp8266_putch(l1+'0');
     _esp8266_putch(l2+'0');
    _esp8266_print("\r\n");
    _esp8266_waitResponse();
    
    _esp8266_print(mail_ID);
    _esp8266_print("\r\n");
    _esp8266_waitResponse();
    
    len = strlen(mail_Pas);
    len+= 2;
    char l2 = len%10;
    char l1 = (len/10)%10;
     
    _esp8266_print("AT+CIPSEND=4,");
    if ((l1+'0')>'0')
    _esp8266_putch(l1+'0');
    _esp8266_putch(l2+'0');
    _esp8266_print("\r\n");
    _esp8266_waitResponse();
    
    
   _esp8266_print(mail_Pas);
    _esp8266_print("\r\n");
    _esp8266_waitResponse();
}
 /*End of Login*/
 
  void _esp8266_mail_sendID(unsigned char* send_ID)
 {
     len = strlen(send_ID);
     len+= 14;
     char l2 = len%10;
     char l1 = (len/10)%10;
     
     _esp8266_print("AT+CIPSEND=4,");
     if ((l1+'0')>'0')
     _esp8266_putch(l1+'0');
     _esp8266_putch(l2+'0');
    _esp8266_print("\r\n");
    _esp8266_waitResponse();
    
    _esp8266_print("MAIL FROM:<");
    _esp8266_print(send_ID);
    _esp8266_print(">\r\n");
    _esp8266_waitResponse();   
 } 
  
  void _esp8266_mail_recID(unsigned char* rec_ID)
 {
     len = strlen(rec_ID);
     len+= 12;
     char l2 = len%10;
     char l1 = (len/10)%10;
     
     _esp8266_print("AT+CIPSEND=4,");
     if ((l1+'0')>'0')
     _esp8266_putch(l1+'0');
     _esp8266_putch(l2+'0');
    _esp8266_print("\r\n");
    _esp8266_waitResponse();
    
    _esp8266_print("RCPT To:<");
    _esp8266_print(rec_ID);
    _esp8266_print(">\r\n");
    _esp8266_waitResponse();   
 } 
  
    void _esp8266_mail_subject(unsigned char* subject)
 {
     len = strlen(subject);
     len+= 10;
     char l2 = len%10;
     char l1 = (len/10)%10;
     
     _esp8266_print("AT+CIPSEND=4,");
     if ((l1+'0')>'0')
     _esp8266_putch(l1+'0');
     _esp8266_putch(l2+'0');
    _esp8266_print("\r\n");
    _esp8266_waitResponse();
    
