dhckddus/PICtmp/Wifi_test_210408.X/ESP8266_functions_0318.h
    if (length < max_length) {
        max_length = length;
    }

    /*sprintf(store_in, "%u,%u:%c%c", length, max_length, _esp8266_getch(), _esp8266_getch());
    return;*/

    uint16_t i;
    for (i = 0; i < max_length; i++) {
        store_in[i] = _esp8266_getch();
    }
    store_in[i] = 0;
    for (; i < length; i++) {
        _esp8266_getch();
    }
    _esp8266_waitFor("OK");
}

/**
 * Output a string to the ESP module.
 *
 * This is a function for internal use only.
 *
 * @param ptr A pointer to the string to send.
 */
void _esp8266_print(unsigned const char *ptr) {
    while (*ptr != 0) {
        _esp8266_putch(*ptr++);
    }
}

/**
 * Wait until we found a string on the input.
 *
 * Careful: this will read everything until that string (even if it's never
 * found). You may lose important data.
 *
 * @param string
 *
 * @return the number of characters read
 */
inline uint16_t _esp8266_waitFor(unsigned char *string) {
    unsigned char so_far = 0;
    unsigned char received;
    uint16_t counter = 0;
    do {
        received = _esp8266_getch();
        counter++;
        if (received == string[so_far]) {
            so_far++;
        } else {
            so_far = 0;
        }
    } while (string[so_far] != 0);
    return counter;
}

/**
 * Wait until we received the ESP is done and sends its response.
 *
 * This is a function for internal use only.
 *
 * Currently the following responses are implemented:
 *  * OK
 *  * ready
 *  * FAIL
 *  * no change
 *  * Linked
 *  * Unlink
 *
 * Not implemented yet:
 *  * DNS fail (or something like that)
 *
 * @return a constant from esp8266.h describing the status response.
 */
inline unsigned char _esp8266_waitResponse(void) {
    unsigned char so_far[6] = {0,0,0,0,0,0};        //quantidade de respostas
    unsigned const char lengths[6] = {2,5,4,9,6,6}; //tamanho das respostas
    unsigned const char* strings[6] = {"OK", "ready", "FAIL", "no change", "Linked", "Unlink"}; //respostas
    unsigned const char responses[6] = {ESP8266_OK, ESP8266_READY, ESP8266_FAIL, ESP8266_NOCHANGE, ESP8266_LINKED, ESP8266_UNLINK};
    unsigned char received;
    unsigned char response;
    bool continue_loop = true;

    while (continue_loop) {
        received = _esp8266_getch();

        for (unsigned char i = 0; i < 6; i++) {
            if (strings[i][so_far[i]] == received) {
                so_far[i]++;
                if (so_far[i] == lengths[i]) {
                    response = responses[i];
                    continue_loop = false;
                }
            } else {
                so_far[i] = 0;
            }
        }
    }
    return response;

}

void envia_pagina()
{      
    _esp8266_print("AT+CIPSEND=0,381\r\n");  //usar: https://www.invertexto.com/contador-caracteres
    __delay_ms(300);                                               
    _esp8266_print("<html><head><title>PSQ</title><meta http-equiv=\"refresh\" content=\"4\" ></head><h1>WEB LED!</h1>"); //94
    _esp8266_print("<body><p><form method=\"GET\"></p>"); //32                             
    _esp8266_print("<p><input type=\"submit\" name=\"B\" value=\"1\" > LED1 ON</p>");       //56
    _esp8266_print("<p><input type=\"submit\" name=\"B\" value=\"2\" > LED1 OFF</p>");    //57
    _esp8266_print("<p><input type=\"submit\" name=\"B\" value=\"3\" > LED2 ON</p>");       //56
    _esp8266_print("<p><input type=\"submit\" name=\"B\" value=\"4\" > LED2 OFF</p>");   //57

    if (PORTAbits.RA3){
        _esp8266_print( "<p>RA3 ON! </p></body></html>\r\n");  //29
    }
    else _esp8266_print("<p>RA3 OFF!</p></body></html>\r\n");  //29


   _esp8266_print("AT+CIPCLOSE=0\r\n");
   __delay_ms(250);  
   _esp8266_print("AT+CIPCLOSE=0\r\n");
   __delay_ms(250);    
}

void recebe_pagina(){
switch (_esp8266_waitResponse2())
        {
            case (LED1ON):
            {
            PORTAbits.RA1=1;
            } 
            break;
        
           case (LED1OFF):
            {
            PORTAbits.RA1=0;
            } 
            break;
            
            case (LED2ON):
            {
            PORTAbits.RA2=1;
            } 
            break;
        
           case (LED2OFF):
            {
            PORTAbits.RA2=0;
            } 
            break;
    }

}

inline unsigned char _esp8266_waitResponse2(void) {
    unsigned char so_far[4] = {0,0,0,0};        //quantidade de respostas
    unsigned const char lengths[4] = {3,3,3,3}; //tamanho das respostas
    unsigned const char* strings[4] = {"B=4", "B=3", "B=2", "B=1"}; //respostas
    unsigned const char responses[4] = {LED2OFF, LED2ON, LED1OFF, LED1ON};
    unsigned char received;
    unsigned char response;
    bool continue_loop = true;
    while (continue_loop) {
        received = _esp8266_getch();
        for (unsigned char i = 0; i < 4; i++) {
            if (strings[i][so_far[i]] == received) {
                so_far[i]++;
                if (so_far[i] == lengths[i]) {
                    response = responses[i];
                    continue_loop = false;
                }
            } else {
                so_far[i] = 0;
            }
        }
    }
    return response;
}



void inicia_esp8266() {
   
    /*Put the module in AP+STA*/
    esp8266_mode(1);
    
    //Lcd_Set_Cursor(2,1);
    //Lcd_Write_String("Modo AP");
    //__delay_ms(300);
    
    esp8266_connect("Nomedesuawifi","senhadesuaWifi"); //somente no modo 1 ou 3

    //Lcd_Set_Cursor(1,1);
    //Lcd_Write_String("Conectado a Wi-Fi");
    //__delay_ms(1000);
    //esp8266_config_softAP("NomeWifi","senhaWiFi");//somente no modo 2 ou 3 Cria Wifi pelo ESP
    
    /*
            unsigned char meuip[4];
            unsigned char data[30]; 
            //verificando o IP
            esp8266_ip(meuip);      //função que carrega o ip no vetor de entrada
            sprintf(data,"IP: %d.%d.%d.%d",meuip[0],meuip[1],meuip[2],meuip[3]); //carrega o ip na string data
     * 
            Lcd_Clear_Line(4);
            Lcd_Set_Cursor(4,1);
            Lcd_Write_String(data);
 */     
    
     _esp8266_enale_MUX();       
    //_esp8266_print("AT+CIPMUX=1\r\n"); //Enable multiple connections
    
    //Lcd_Set_Cursor(2,1);
    //Lcd_Write_String("MUX ativado");
    //__delay_ms(1000);
    
    _esp8266_create_server();  
    
    //Lcd_Set_Cursor(2,1);
    //Lcd_Write_String("Web OK");
    //__delay_ms(1000);
    
    //_esp8266_print("AT+CWDHCP=0,0\r\n")   //Desabilita DHCP - MODO STA
    //_esp8266_print("AT+CIPAP=\"192.168.5.5\"\r\n");   //Escolher ip MODO STA
    
